app/Controllers/Forum.php

    public function store()
    {
        // Cek login
        if (!session()->has('user_id')) {
            return redirect()->to(site_url('auth/login'));
        }

        // Validasi
        if (!$this->validate([
            'title'   => 'required|min_length[5]|max_length[255]',
            'content' => 'required|min_length[10]',
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Sanitasi input
        $data = [
            'user_id' => session()->get('user_id'),
            'title'   => $this->request->getPost('title'),
            'content' => $this->request->getPost('content'),
        ];

        if ($this->postModel->insert($data)) {
---
INSERT INTO `posts` (`user_id`, `title`, `content`, `created_at`, `updated_at`) VALUES ('3', 'IOT aja', 'T nya Apa????', '2026-07-01 04:19:14', '2026-07-01 04:19:14')

    public function storeReply($postId)
    {
        // Cek login
        if (!session()->has('user_id')) {
            return redirect()->to(site_url('auth/login'));
        }

        // Cek post exist
        $post = $this->postModel->find($postId);
        if (!$post) {
            return redirect()->to(site_url('forum'))->with('error', 'Posting tidak ditemukan.');
        }

        // Validasi
        if (!$this->validate([
            'content' => 'required|min_length[3]',
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Simpan reply
        $data = [
            'post_id' => $postId,
            'user_id' => session()->get('user_id'),
            'content' => $this->request->getPost('content'),
        ];

        if ($this->replyModel->insert($data)) {
---
SELECT *
FROM `posts`
WHERE `posts`.`id` = '1'
INSERT INTO `replies` (`post_id`, `user_id`, `content`, `created_at`, `updated_at`) VALUES ('1', '3', 'iya jirrlah', '2026-07-01 03:22:42', '2026-07-01 03:22:42')

    public function delete($postId)
    {
        // Cek login
        if (!session()->has('user_id')) {
            return redirect()->to(site_url('auth/login'));
        }

        $post = $this->postModel->find($postId);

        if (!$post) {
            return redirect()->to(site_url('forum'))->with('error', 'Posting tidak ditemukan.');
        }

        // Cek apakah user adalah pemilik post
        if ($post['user_id'] != session()->get('user_id')) {
            return redirect()->back()->with('error', 'Anda hanya bisa menghapus posting milik Anda sendiri.');
        }

        if ($this->postModel->delete($postId)) {
---
SELECT *
FROM `posts`
WHERE `posts`.`id` = '2'
DELETE FROM `posts`
WHERE `id` IN ('2')