app/Models/PostModel.php

SELECT `posts`.*, `users`.`username`
FROM `posts`
JOIN `users` ON `users`.`id` = `posts`.`user_id`
ORDER BY `posts`.`created_at` DESC
---
    public function getAllPostsWithUser()
    {
        return $this->select('posts.*, users.username')
                    ->join('users', 'users.id = posts.user_id')
                    ->orderBy('posts.created_at', 'DESC')
                    ->findAll();

SELECT `posts`.*, `users`.`username`
FROM `posts`
JOIN `users` ON `users`.`id` = `posts`.`user_id`
WHERE `posts`.`id` = '1'
 LIMIT 1
---
    public function getPostWithUser($postId)
    {
        return $this->select('posts.*, users.username')
                    ->join('users', 'users.id = posts.user_id')
                    ->where('posts.id', $postId)
                    ->first();