app/Models/ReplyModel.php

    public function getRepliesByPost($postId)
    {
        return $this->select('replies.*, users.username')
                    ->join('users', 'users.id = replies.user_id')
                    ->where('replies.post_id', $postId)
                    ->orderBy('replies.created_at', 'ASC')
                    ->findAll();
---
SELECT `replies`.*, `users`.`username`
FROM `replies`
JOIN `users` ON `users`.`id` = `replies`.`user_id`
WHERE `replies`.`post_id` = '1'
ORDER BY `replies`.`created_at` ASC

    public function getReplyCount($postId)
    {
        return $this->where('post_id', $postId)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `replies`
WHERE `post_id` = '1'